## Tap external sources ##

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

## Homebrew applications ##

# Utility bundles
brew 'coreutils'                  # GNU Coreutils
brew 'moreutils'                  # Missing Coreutils

# Essential
brew 'curl'
brew 'grep'
brew 'vim'                        # Update to Vim8
brew 'wget'
brew 'zsh'                        # Better shell

# Missing Utilities
brew 'fdupes'                     # Finding duplicate files
brew 'jo'                         # JSON output from CLI
brew 'jq'                         # CLI JSON processor
brew 'nmap'                       # Network Mapper
brew 'p7zip'                      # Unzip weird stuff
brew 'tmux'                       # Terminal multiplexer
brew 'tree'                       # Tree view for folder content

# Developer tools
brew 'git'                        # Git
brew 'git-extras'                 # Better git tools
brew 'hub'                        # Github flavoured Git
brew 'icdiff'                     # Improved colored diff
brew 'iproute2mac'                # Run "ip addr show" on mac
brew 'peco'                       # Simplistic interactive filtering tool
brew 'progress'                   # Show progress for cp, mv, dd, ..
brew 'the_silver_searcher'        # Code searching tool, like grep
brew 'shellcheck'                 # Static analysis of shell scripts

# Brew cask repair
brew 'vitorgalvao/tiny-scripts/cask-repair'


# MacAppStore
brew 'mas'                        # CLI version of Mac App Store

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'                     # Replacement terminal with shell integration

# Browsers
# cask 'firefox'
# cask 'google-chrome'
cask 'brave-browser'

# Communications
cask 'discord'                    # Community and voice Chats
# cask 'mattermost'                 # Team chats
# cask 'mumble'                     # Voice chat, seasonal usage
# cask 'rocket-chat'                # Team chats, seasonal usage
cask 'signal'                     # Encrypted communications
# cask 'skype'                      # Online video calls, chat
# cask 'slack'                      # Team chats

# Media
# cask 'soundcleod'               # Soundcloud desktop application
cask 'steam'                      # Video game digital distribution service


# Utilities
cask '1password'                  # Install 1password7
# cask 'aldente'                   # Power management
cask 'alfred'                     # Little helper all around
# cask 'balenaetcher'               # Writing images to USB and SD cards
# cask 'keycastr'                   # Screencasting key presses
#cask 'tunnelblick'                # Free and open-source OpenVPN client
cask 'dropbox'                    # Client for the Dropbox cloud storage service
cask 'gimp'                       # Free and open-source image editor
cask 'todoist'                    # The to do list to organize work and life
cask 'google-earth-pro'             # 3D render of earth with various tools
cask 'parallels'                    # VMs on M1


# Developer Tools
cask 'atom'                       # General IDE
# cask 'docker'                     # Docker for Mac
# cask 'visual-studio-code'         # IDE for some programming work
# cask 'arduino'                    # Aruduino IDE
# cask 'pycharm-ce'                 # PyCharm community
cask 'pycharm'                    # PyCharm pro

# 3D Printing / Designer
cask 'freecad'                    # 3D CAD modeling

## Fonts

# cask "font-hack-nerd-font"

## MacAppStore ##

# Utilities
mas 'DigiDoc4 Client',	id: 1370791134    # Digital signing application for EstEID

# Media
# mas 'Final Cut Pro',	id: 424389933

# Office alternative
# mas 'Keynote',	id: 409183694
# mas 'Numbers',	id: 409203825
# mas 'Pages',		id: 409201541

# Developer Tools
# mas 'XCode',		id: 497799835
