## Tap external sources ##

tap "homebrew/bundle"
# tap "homebrew/cask" Error: Tapping homebrew/cask is no longer typically necessary.
# tap "homebrew/core" Tapping homebrew/core is no longer typically necessary.
# Add --force if you are sure you need it for contributing to Homebrew.


## Homebrew applications ##

# Utility bundles
brew 'coreutils'                  # GNU Coreutils
brew 'moreutils'                  # Missing Coreutils

# Essential
brew 'curl'
brew 'grep'
brew 'vim'                        # Update to Vim8
brew 'wget'
brew 'zsh'                        # Better shell
brew 'powerlevel10k'              # zsh theme

# Missing Utilities
brew 'fdupes'                     # Finding duplicate files
brew 'nmap'                       # Network Mapper
brew 'p7zip'                      # Unzip weird stuff
brew 'tree'                       # Tree view for folder content nice to have

# Developer tools
brew 'git'                        # Git
brew 'git-extras'                 # Better git tools
brew 'hub'                        # Github flavoured Git
brew 'icdiff'                     # Improved colored diff
brew 'iproute2mac'                # Run "ip addr show" on mac
brew 'peco'                       # Simplistic interactive filtering tool
brew 'progress'                   # Show progress for cp, mv, dd, ..
brew 'shellcheck'                 # Static analysis of shell scripts

# Extras
brew 'openvpn'                    # OpenVPN client

# Brew cask repair
# brew 'vitorgalvao/tiny-scripts/cask-repair' # not nessary for me at the moment


# MacAppStore
brew 'mas'                        # CLI version of Mac App Store

## Cask applications ##

cask_args appdir: '/Applications'

# Terminal
cask 'iterm2'                     # Replacement terminal with shell integration

# Browsers
# cask 'firefox'
# cask 'google-chrome'
cask 'brave-browser'

# Communications
cask 'discord'                    # Community and voice Chats
# cask 'signal'                   # Encrypted communications
cask 'slack'                      # Team chats

# Media
cask 'steam'                      # Video game digital distribution service
cask 'focusrite-control'          # Focusrite interface controller
cask 'vlc'                        # Multimedia player


# Utilities
cask '1password'                  # Install 1password
cask 'balenaetcher'               # Writing images to USB and SD cards
cask 'raspberry-pi-imager'        # Imaging utility to install operating systems to a microSD card
cask 'microsoft-word'             # Word processor
# cask 'tunnelblick'              # Free and open-source OpenVPN client
# cask 'google-earth-pro'         # 3D render of earth with various tools
cask 'qgis'                       # Geographic Information System
cask 'utm'                        # Virtual machines UI using QEMU

# Photography Tools
cask 'darktable'                  # Photography workflow application and raw developer
cask 'gimp'                       # Free and open-source image editor


# Developer Tools
cask 'docker'                     # Docker for Mac
cask 'visual-studio-code'         # Open-source code editor
# cask 'arduino'                  # Aruduino IDE
# cask 'pycharm-ce'               # PyCharm community
# cask 'pycharm'                  # PyCharm pro

# 3D Printing / Designer
# cask 'freecad'                  # 3D CAD modeling
cask 'openscad'                   # Programmable solid 3D CAD modeller

## Fonts
# no fonts here


## MacAppStore ##

# Utilities
mas 'DigiDoc4 Client',	id: 1370791134    # Digital signing application for EstEID
mas 'wireguard', id: 1451685025    # Fast, modern, and secure VPN tunnel

# Developer Tools
# mas 'XCode',		id: 497799835
